"情報同士の関わり合いには一定のパターンがある。例えば、「Aという情報はBという媒体によって強化される。そのことはCという事実に体現される。」といったように。この文章内ではA B Cはそれぞれ型のようなものを持っている。Cが具体的 Bの形容詞的 Aが何かしら強度をもつ情報であること。などである。評論は「事実=>>考察」「事実=>>考察」「事実=>>考察」「事実=>>考察」「事実=>>考察」「事実=>>考察」「事実=>>考察」「事実=>>考察」「事実=>>考察」 ... というのが普通だけど、それは本質ではない。評論というものが表現する、情報同士の関係性のダイアグラム、およびそこから示唆される世界全体の情報の流れというものが本質なのである。これは言い換えると、個々の具体的な言説から離れ、抽象的な構造を考える、SF的にみるということである。"

import {registerAtom, registerConjunction, validateSentence} from "./hyouron.js"
import {pushInfo, getInfo, getFieldSize} from "./info_field.js"

